using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Tukuritaimono : MonoBehaviour
{
    /// <summary>
    ///　・２Dと３Dを組み合わせてゴールを目指す謎解きアクションゲームを作る！！！
    ///　・２Dにはマリオみたいなドット絵と1ドットの立ち絵
    ///　・３Dにはブレンダーで作ったキャラ
    /// 
    ///　・基本的な操作
    ///　・２Dと３Dでの動き　　　　基本的なの完成
    ///　・主人公の強化アイテム 　いらないかも？
    ///　・敵キャラの実装（２Dでしか姿が出ないキャラとかもつくりたいな）
    ///　・敵
    ///　    ・おばけ
    ///　    ・ピーマン・ナス
    ///　    ・蛾
    ///　    ・ゴキブリ
    ///　    ・爆弾
    ///　    ・画鋲
    ///　    ・雷
    ///　    ・毛虫
    ///　    ・なまはげ　　？
    ///　    ・魔女　毒リンゴ
    ///　・３Dでのカメラ操作？　　必要？
    ///　・
    /// 
    /// 　・連結したブロックをあるけるようにする   完成
    /// 
    ///　・ステージギミック
    ///　・ブロックの上り下り完成　当たり判定完成
    ///  ・ちくわブロック  完成？
    ///　・ジャンプしたらすり抜けるブロック  完成
    ///　・竜巻（敵キャラとかプレイヤーが浮くやつ）  プレイヤーのはかんせい　
    ///　・ハテナブロックとか壊れるブロックとか
    ///　・トレジャーハンターが出会いそうな転がる大岩とか
    ///　・クモの巣（移動速度減少、ジャンプ力減少）
    ///　
    ///　他に必要なもの
    ///　・音
    ///　・２Dキャラと３Dキャラの姿（ブレンダー、　）
    ///
    /// 
    ///     プログラミングコード　　0715完成
    /// 
    /// 
    /// 
    /// 
    /// 
    /// 　家の作成  完成
    /// 　
    ///   芋虫に乗れる・押されるようにする  完成？
    ///   オブジェクトのエラー対処　完成！
    ///   音楽を流す
    /// 　タイトル画面　操作説明画面　ゲームクリア画面　ゲームオーバー画面　作成　だけ
    ///  ステージの構成　ObjSet から　あと2ステージ　　
    /// 
    /// </summary>




    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
